JavaScript만 사용하는 것과 비교해 TypeScript를 사용하는 이유에 대해 설명해 주세요.
---

2012년 마이크로소프트가 개발한 ‘TypeScript’는 JavaScript 기반의 정적 타입 문법을 추가한 ‘프로그래밍 언어’입니다.
TypeScript는 JavaScript의 슈퍼 셋, 즉 상위 확장자로 JavaScript 엔진을 사용하며 자신이 원하는 변수의 타입을 정의하고 프로그래밍을 하면 JavaScript로 컴파일되어 실행할 수 있습니다. 

TypeScript는 JavaScript의 단점 중 하나인 동적으로 타입을 지정하는 특징을 보완하면서 등장했는데,
동적 타입 지정이란, 변수의 타입이 런타임 즉 실행 시간에 결정되는 것으로 JavaScript는 대표적인 동적 타입 언어입니다. 

동적 타입 언어는 사용하는 변수의 타입을 신경쓰지 않고 실행 시간에 알아서 결정해 주기 때문에 배우기 쉽고 유연하다는 장점이 있지만, 
동시에 런타임에서 에러가 발생할 경우를 미리 찾지 못한다는 단점이 있습니다.

하지만 Typescript는 정적 타입 언어로 변수의 타입을 명시적으로 지정하여 사용하고, 이를 컴파일 시에 '타입 어노테이션'을 활용하여 타입 체크를 하기 때문에
타입에 관련한 오류 뿐만 아니라 런타임에 발생할 가능성이 있는 오류도 미리 확인하고 고칠 수 있다는 장점이 있습니다.
